<?php
///  запустить скрипт можно набрав в консоли браузера http://3.rowing123.ru/main.php

require_once('newfarm.php');///добавление модели системы
require_once('Farm.php');//добавление контроллера системы

echo "<br>____________________________________________________________Коровы_______________________________________________________________<br>";
ScriptController($c=new cows,10,1);
echo "<br><br>____________________________________________________________Курицы_______________________________________________________________<br>";
//запуск скрипта и первоначальная инициализация
ScriptController($ch=new chikens,20,5);
$qwe=array_chunk($GLOBALS['sum'], 2);
///подсчет всей собранной продукции через глобальную переменную
$first = 0;
$second = 0;
foreach ($qwe as $key=>$item)

{

    $first+=$item[0];
    $second+=$item[1];
}


echo "<br>__________________________________________________________________________________________________________________________________";
echo "<br><br> Собранно за первую неделю яиц и молока вместе:";

echo $first;

echo "<br><br> Собранно за вторую неделю яиц и молока вместе:";

echo $second;
